TexasInstruments/mcupsdk-core/examples/drivers/ecap/ecap_signal_monitoring/am263px-cc/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_S" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM263P4-Q1" --package "NFBGA (ZCZ-S)" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const ecap            = scripting.addModule("/drivers/ecap/ecap", {}, false);
const ecap1           = ecap.addInstance();
const ecap2           = ecap.addInstance();
const ecap3           = ecap.addInstance();
const ecap4           = ecap.addInstance();
const ecap5           = ecap.addInstance();
const ecap6           = ecap.addInstance();
const epwm            = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1           = epwm.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const input_xbar      = scripting.addModule("/xbar/input_xbar/input_xbar", {}, false);
const input_xbar1     = input_xbar.addInstance();
const int_xbar        = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1       = int_xbar.addInstance();
const int_xbar2       = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ecap1.enableInterrupt                     = true;
ecap1.interruptSourceAPWM                 = ["ECAP_ISR_SOURCE_COUNTER_PERIOD"];
ecap1.ecapInput                           = "ECAP_INPUT_INPUTXBAR0";
ecap1.reArm                               = true;
ecap1.enableLoadCounter                   = true;
ecap1.eventStop                           = "ECAP_EVENT_2";
ecap1.resetCounters                       = true;
ecap1.trip_selection_signalMunit          = "ECAP_MUNIT_TRIP_EPWM_XBAR_OUT0";
ecap1.global_strobe_selection_signalMunit = "ECAP_MUNIT_GLDSTRB_EPWM0";
ecap1.enable_monitorunit1                 = true;
ecap1.enableDebug_1                       = true;
ecap1.$name                               = "MON_PULSE_HIGH";
ecap1.eventTwoPolarity                    = "ECAP_EVNT_FALLING_EDGE";
ecap1.interruptSourceCapture              = ["ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT2","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT2"];
ecap1.minValue_1                          = 9950;
ecap1.maxValue_1                          = 10050;

ecap2.enableInterrupt        = true;
ecap2.interruptSourceAPWM    = ["ECAP_ISR_SOURCE_COUNTER_PERIOD"];
ecap2.ecapInput              = "ECAP_INPUT_INPUTXBAR0";
ecap2.reArm                  = true;
ecap2.enableLoadCounter      = true;
ecap2.eventStop              = "ECAP_EVENT_2";
ecap2.resetCounters          = true;
ecap2.enable_monitorunit1    = true;
ecap2.enableDebug_1          = true;
ecap2.interruptSourceCapture = ["ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT2","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT2"];
ecap2.ecapBase               = "CSL_CONTROLSS_ECAP1_U_BASE";
ecap2.$name                  = "MON_PULSE_LOW";
ecap2.eventOnePolarity       = "ECAP_EVNT_FALLING_EDGE";
ecap2.monitorSelect_1        = "ECAP_MUNIT_LOW_PULSE_WIDTH";
ecap2.minValue_1             = 9950;
ecap2.maxValue_1             = 10050;

ecap3.$name                  = "MON_PERIOD_HIGH";
ecap3.ecapBase               = "CSL_CONTROLSS_ECAP2_U_BASE";
ecap3.eventStop              = "ECAP_EVENT_2";
ecap3.enableLoadCounter      = true;
ecap3.resetCounters          = true;
ecap3.reArm                  = true;
ecap3.interruptSourceCapture = ["ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT2","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT2"];
ecap3.enableInterrupt        = true;
ecap3.enable_monitorunit1    = true;
ecap3.enableDebug_1          = true;
ecap3.minValue_1             = 19950;
ecap3.maxValue_1             = 20050;
ecap3.ecapInput              = "ECAP_INPUT_INPUTXBAR0";
ecap3.monitorSelect_1        = "ECAP_MUNIT_PERIOD_WIDTH_RISE_RISE";

ecap4.$name                  = "MON_PERIOD_LOW";
ecap4.ecapBase               = "CSL_CONTROLSS_ECAP3_U_BASE";
ecap4.eventOnePolarity       = "ECAP_EVNT_FALLING_EDGE";
ecap4.eventTwoPolarity       = "ECAP_EVNT_FALLING_EDGE";
ecap4.eventStop              = "ECAP_EVENT_2";
ecap4.enableLoadCounter      = true;
ecap4.resetCounters          = true;
ecap4.reArm                  = true;
ecap4.interruptSourceCapture = ["ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_1_ERROR_EVT2","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT1","ECAP_ISR_SOURCE_MUNIT_2_ERROR_EVT2"];
ecap4.enableInterrupt        = true;
ecap4.enable_monitorunit1    = true;
ecap4.enableDebug_1          = true;
ecap4.minValue_1             = 19950;
ecap4.maxValue_1             = 20050;
ecap4.ecapInput              = "ECAP_INPUT_INPUTXBAR0";
ecap4.monitorSelect_1        = "ECAP_MUNIT_PERIOD_WIDTH_FALL_FALL";

